test/requests/payee_payable_error_req.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soap12:Body>
    <PayeePayable xmlns="http://Tipalti.org/">
      <payerName>MyPayer</payerName>
      <timestamp>1521234048</timestamp>
      <key>12e4af1fff12d24a69d3de363fe52a07935dc4a4fcafec5a62b64cbb5c5d1d1c</key>
      <idap>badpayee</idap>
      <amount>123.45</amount>
    </PayeePayable>
  </soap12:Body>
</soap12:Envelope>
